controltheory/beamer/4/4_3_general.tex
% Created 2014-10-14 星期二 18:02
\documentclass{beamer}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{etex}
\usepackage{amsmath}
\usepackage{pstricks}
\usepackage{pgfplots}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{广义根轨迹与零度根轨迹}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性系统的根轨迹法}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}

















\section{广义根轨迹}
\label{sec-1}
\begin{frame}
\frametitle{广义根轨迹}
\label{sec-1-1}

变化参数可以是系统任意参数
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<2->{例:}
\label{sec-1-1-1}


$T_a$ 从 $0\rightarrow+\infty$ 时系统根轨迹.

\begin{tikzpicture}[node distance=2em,auto,>=latex', thick]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$ $,right =of r] (p1) { }; 
\path[->](r) edge node {} (p1) ; 
%\path[red] node[draw, right =of p1] (n) {$N$}; 
%\path[->] (p1) edge node[midway] {$x(t)$} (n) ; 
\path[red] node[draw, inner sep=5pt,right =of p1] (g) {$\frac{5}{s(5s+1)}$}; 
\path[->] (p1) edge node [midway]{$ $} (g); 
\path[->] node[ right =of g] (o) {$c(t)$}; 
\path[->] (g) edge node {} (o); 
\path[red] node[draw, inner sep=5pt,below =of g] (h) {$T_a s+1$}; 
\path[->,draw] (g.east)+(1em,0) |- (h.east); 
\path[->, draw] (h) -| node[very near end] {$-$} (p1); 
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\end{tikzpicture} 

解: 
\begin{eqnarray*}
G_o(s) &=&\frac{5(T_a s+1)}{s(5s+1)}\\
D(s) & = & 5s^2+(5T_a+1)s+5 \\
\end{eqnarray*}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<3->{构造系统,}
\label{sec-1-1-2}


\[D(s)=5s^2+(5T_a+1)s+5\] 

等效开环传递函数: 

\[G'_o(s)=\frac{5T_a s}{5s^2+s+5}\]

求其 $180^\circ$ 根轨迹即可 .
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{广义根轨迹示例1}
\label{sec-1-2}

某负反馈系统开环传递函数为 $G_o(s)=\frac{K}{s(Ts+1)},K>0$  求 $T$ 从 $0\rightarrow+\infty$ 时闭环极点的运动轨迹,
并证明其根轨迹非实轴上的点构成一个圆,求出圆心和半径.
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<2->{解:}
\label{sec-1-2-1}

构造等效开环传递函数 $G_o'(s)$
\begin{eqnarray*}
D(s) &= & Ts^2+s+K \\
G_o'(s) &=&\frac{Ts^2}{s+K} \\
\end{eqnarray*}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<3->{根轨迹图}
\label{sec-1-2-2}


\begin{tikzpicture}
\coordinate (o) at (0,0);
\coordinate (ox) at (0.5,0);
\draw[->] (-3,0) -- (ox);
\draw[->] (0,-1.5) -- (0,1.5);
\draw (o) node[below left] {$o$};
\draw[thick,red] (-1,0) node {$\times$};
\draw[thick,red] (0,0) node {$o$};
%\draw [red,thick,smooth] plot coordinates {(-1,1) (-0.9,0.8) (-0.8,0.2) (-0.8,0) };
\draw [<->,red,thick] (0,0) arc (0:360:1);
\draw [->,red,thick] (-3,0)--(-2,0);
\draw [->,red,thick] (-1,0)--(-2,0);
\draw (-2,0) node[above left] {$-2K$};
\draw (-1,0) node[above ] {$-K$};
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{广义根轨迹示例1(续)}
\label{sec-1-3}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}<2->{解法2:}
\label{sec-1-3-1}

\begin{eqnarray*}
Ts^2+s+K &=& 0 \\
s^2+\frac{1}{T}(s+K) &=& 0\\
G_o'(s) &=&\frac{K_g(s+K)}{s^2} \\
\frac{1}{T} &=& K_g
\end{eqnarray*}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<3->{根轨迹图}
\label{sec-1-3-2}

\begin{tikzpicture}
\coordinate (o) at (0,0);
\coordinate (ox) at (0.5,0);
\draw[->] (-3,0) -- (ox);
\draw[->] (0,-1.5) -- (0,1.5);
\draw (o) node[below left] {$o$};
\draw[thick,red] (0,0) node {$\times$};
\draw[thick,red] (-1,0) node {$o$};
%\draw [red,thick,smooth] plot coordinates {(-1,1) (-0.9,0.8) (-0.8,0.2) (-0.8,0) };
\draw [red,thick] (0,0) arc (0:360:1);
\draw [<->,red,thick] (-3,0)--(-1,0);
\draw (-2,0) node[above left] {$-2K$};
\draw (-1,0) node[above ] {$-K$};
\end{tikzpicture}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{广义根轨迹示例1(续) 证明其非实轴上的根轨迹为圆:}
\label{sec-1-4}

\begin{itemize}
\item 设根轨迹非实轴上的点为 $x+iy$, $D(s) = Ts^2+s+K=0$
       \begin{eqnarray*}
       T(x+iy)^2+x+iy+K &=& 0 \\
       T(x^2-y^2)+x+K+i(y+2xyT) &=& 0 \\
       Tx^2-Ty^2+x+K &=& 0 \\
       y+2xyT &=& 0 \\
       \end{eqnarray*}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{广义根轨迹示例1(续) 圆心与半径:}
\label{sec-1-5}

\begin{itemize}
\item 消去 $T$ 后,得:
       \begin{eqnarray*}
       \frac{-x}{2}+\frac{y^2}{2x}+x+K & = & 0 \\
       \frac{x}{2}+\frac{y^2}{2x}+K & = & 0 \\
       x^2+y^2+2xK & = & 0 \\
       (x+K)^2+y^2=K^2 
       \end{eqnarray*}
\item <2-> 圆心为 $(-K,0)$ ,半径为 $K$
\end{itemize}
\end{frame}
\section{零度根轨迹}
\label{sec-2}
\begin{frame}
\frametitle{零度根轨迹(正反馈系统)}
\label{sec-2-1}


\begin{tikzpicture}[node distance=2em,auto,>=latex', thick]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$ $,right =of r] (p1) { }; 
\path[->](r) edge node {} (p1) ; 
%\path[red] node[draw, right =of p1] (n) {$N$}; 
%\path[->] (p1) edge node[midway] {$x(t)$} (n) ; 
\path[red] node[draw, inner sep=5pt,right =of p1] (g) {$G(s)$}; 
\path[->] (p1) edge node [midway]{$ $} (g); 
\path[->] node[ right =of g] (o) {$c(t)$}; 
\path[->] (g) edge node {} (o); 
\path[red] node[draw, inner sep=5pt,below =of g] (h) {$H(s)$}; 
\path[->,draw] (g.east)+(1em,0) |- (h.east); 
\path[->, draw] (h) -| node[very near end] {$+$} (p1); 
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\end{tikzpicture} 

\begin{eqnarray*}
\Phi(s) &= &\frac{G(s)}{1-G(s)H(S)} \\
D(s) &=& 1-G(s)H(s) 
\end{eqnarray*}

\begin{itemize}
\item <2->幅值条件: $|G(s)H(s)|=1$
\item <3->相角条件: $\angle G(s)H(s) =2k\pi$
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{根轨迹的起点,终点及分支数}
\label{sec-2-2}

\begin{itemize}
\item 根轨迹起源于开环极点
\item 终止于开环零点
\item 有 $\max(m,n)$ 条分支数, 有n-m条趋向无穷远处.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{根轨迹的对称性}
\label{sec-2-3}

    根轨迹对称于实轴
\end{frame}
\begin{frame}
\frametitle{实轴上的根轨迹}
\label{sec-2-4}

    实轴上某区域若其右边开环实数零极点个数之和为偶数,则该区域为根轨迹区域.
\end{frame}
\begin{frame}
\frametitle{渐近线}
\label{sec-2-5}

\begin{itemize}
\item $\sigma_a =\frac{\sum_{i=1}^n p_i -\sum_{j=1}^m z_j}{n-m}$
\item $\phi = \frac{2k\pi}{n-m}$
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{>分离点与分离角}
\label{sec-2-6}

\begin{itemize}
\item 分离点: $M'(s)N(s)-M(s)N'(s)=0$
\item 分离角: $\theta_d=\frac{(2k+1)\pi}{l}, k=0,1,\cdots,l-1$, 其中 $l$ 为分离点处根轨迹的分支数
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{根轨迹的起始角与终止角}
\label{sec-2-7}

     \begin{eqnarray*}
     \theta_{p_i} & = & \frac{2k\pi}{I}+\frac{1}{I}\left[\sum_{j=1}^m\angle(p_i-z_j)-\sum_{\substack{j=1 \\ p_j\neq p_i}}^n\angle(p_i-p_j)\right] \\
     \phi_{z_j} & = & \frac{2k\pi}{J}-\frac{1}{J}\left[\sum_{\substack{i=1 \\ z_i\neq z_j}}^m\angle(z_j-z_i)-\sum_{i=1}^n\angle(z_j-p_i)\right] 
     \end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{根轨迹与虚轴交点}
\label{sec-2-8}

\begin{itemize}
\item 直接计算 将 $s=j\omega$ 代入 $D(s)$ ,求出 $K_g,\omega$ , $(0,j\omega)$ 即为交点
\item 利用Routh判据计算
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{根之和: $n-m\geq 2$ 时, 闭环极点之和等于开环极点之和}
\label{sec-2-9}
\end{frame}
\begin{frame}
\frametitle{零度根轨迹示例1:}
\label{sec-2-10}


某正反馈系统开环传递函数为 $G_o(s)=\frac{K_g(s+2)}{(s+3)(s^2+2s+2)}$

解:
\begin{itemize}
\item <2->开环零点: $-2$, 开环极点: $-1\pm j, -3$
\item <3->分离点: $M'(s)N(s)-M(s)N'(s)=0$ 得: $s=-0.8$
\item <4->起始角: $\theta=\pm 71.6^\circ$

        \begin{tikzpicture}
        \coordinate (o) at (0,0);
        \coordinate (ox) at (0.5,0);
        \draw[->] (-3.5,0) -- (ox);
        \draw[->] (0,-1.5) -- (0,1.5);
        \draw (o) node[below left] {$o$};
        \draw[thick,red] (-3,0) node {$\times$};
        \draw[thick,red] (-1,1) node {$\times$};
        \draw[thick,red] (-1,-1) node {$\times$};
        \draw[thick,red] (-2,0) node {$o$};
        \draw [red,thick,smooth] plot coordinates {(-1,1) (-0.9,0.8) (-0.8,0.2) (-0.8,0) };
        \draw [red,thick,smooth] plot coordinates {(-1,-1) (-0.9,-0.8) (-0.8,-0.2) (-0.8,0) };
        \draw [->,red,thick] (-3,0)--(-3.5,0);
        \draw [<->,red,thick] (-2,0)--(0.5,0);
        \draw (-3,0) node[above ] {$-3$};
        \draw (-2,0) node[above ] {$-2$};
        \end{tikzpicture}
\end{itemize}
\end{frame}

\end{document}
